YouTube Watcher/app/views/executed_searches/_results.html.erb

SELECT "videos".* FROM "videos" WHERE "videos"."executed_search_id" = ?  [["executed_search_id", 8]]
---
    <tbody>
    <% @eys.videos.each do |video| %>