YouTube Watcher/app/controllers/executed_searches_controller.rb

SELECT  "executed_searches".* FROM "executed_searches" WHERE "executed_searches"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def update
    @eys = ExecutedSearch.find(params[:id])

SELECT  "executed_searches".* FROM "executed_searches" WHERE "executed_searches"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @eys = ExecutedSearch.find(params[:id])