YouTube Watcher/app/controllers/users_controller.rb

  def set_user
    u = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]