YouTube Watcher/app/controllers/youtube_searches_controller.rb

  def create
    @ys = YoutubeSearch.new(safe_params.merge(user: current_user))
    if @ys.save
---
INSERT INTO "youtube_searches" ("name", "search_terms", "created_at", "updated_at", "user_id", "alert_on_new_result") VALUES (?, ?, ?, ?, ?, ?)  [["name", "volvo wagons"], ["search_terms", "volvo wagons"], ["created_at", 2017-04-05 22:42:05 UTC], ["updated_at", 2017-04-05 22:42:05 UTC], ["user_id", 1], ["alert_on_new_result", true]]

  def edit
    @ys = YoutubeSearch.find(params[:id])
---
SELECT  "youtube_searches".* FROM "youtube_searches" WHERE "youtube_searches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @ys = YoutubeSearch.find(params[:id])
    @ys.update_attributes(safe_params)
---
SELECT  "youtube_searches".* FROM "youtube_searches" WHERE "youtube_searches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "youtube_searches" SET "search_terms" = ?, "updated_at" = ? WHERE "youtube_searches"."id" = ?  [["search_terms", "anvils for trains"], ["updated_at", 2017-04-05 15:49:56 UTC], ["id", 2]]

  def show
    @ys = YoutubeSearch.find(params[:id])
---
SELECT  "youtube_searches".* FROM "youtube_searches" WHERE "youtube_searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]